        01 MY-RECORD.
            05 CLAIM-NUMBER             PIC X(3). 
            05 ADMISSION-DATE           PIC S9(4).
            05 FULL-DAYS                PIC S9(5).
            05 INTERMEDIARY-NUM         PIC 9(2). 
            05 PROVIDER                 PIC X(3). 
            05 INPATIENT-DED            PIC S9(4)V99.
            05 PATIENT-STATUS           PIC X(2).